# есть к примеру список с именами  тут поработаем со списком и с цикалами
# вот есть список и нужно его прогнать черех for например
# делаем список список всегда с квадартными скобками

#Лист проституток

names =["Белла", "Снежанна", "Виолетта", "Изабэлла"]
print(names)

for name in names:  # вот такой простой цикл делает следующее ты тупо создаешь переменную name для читабельности
    print (name)    # не вот эту вот ебучую i  которая непонятно что и как а понятное читабельное имя name
                    # так вот конструкци типа for name in names а потом принт name
                    # тупо берет и принтит все составляюше в списке Агонь же





